notebook/java/Semaphore.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-13 Thu 22:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Semaphore 源码分析</title>
<meta name="author" content="Saul Lawliet" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/assets/css/org.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Semaphore 源码分析</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org634d707">使用示例</a></li>
<li><a href="#org6367f48">Semaphore 定义</a></li>
<li><a href="#orge7623a7">NonfairSync</a>
<ul>
<li><a href="#orgafbf643">acquire()</a></li>
<li><a href="#org6d19018">release()</a></li>
</ul>
</li>
<li><a href="#orge9f1f33">FairSync</a>
<ul>
<li><a href="#orgc2df4e9">acquire()</a></li>
<li><a href="#org7e27469">release()</a></li>
</ul>
</li>
<li><a href="#orgaf01ea5">小结</a></li>
</ul>
</div>
</div>
<p>
环境: <a href="http://hg.openjdk.java.net/jdk8/jdk8/jdk/file/687fd7c7986d">jdk8</a><br />
</p>

<div id="outline-container-org634d707" class="outline-2">
<h2 id="org634d707">使用示例</h2>
<div class="outline-text-2" id="text-org634d707">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Pool</span> {
  <span style="color: #51afef;">private</span> <span style="color: #51afef;">static</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">MAX_AVAILABLE</span> = <span style="color: #da8548; font-weight: bold;">100</span>;
  <span style="color: #51afef;">private</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">Semaphore</span> <span style="color: #dcaeea;">available</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Semaphore</span>(MAX_AVAILABLE, <span style="color: #a9a1e1;">true</span>);

  <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">Object</span> <span style="color: #c678dd;">getItem</span>() <span style="color: #51afef;">throws</span> <span style="color: #ECBE7B;">InterruptedException</span> {
    available.acquire();
    <span style="color: #51afef;">return</span> getNextAvailableItem();
  }

  <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">putItem</span>(<span style="color: #ECBE7B;">Object</span> <span style="color: #dcaeea;">x</span>) {
    <span style="color: #51afef;">if</span> (markAsUnused(x))
      available.release();
  }

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Not a particularly efficient data structure; just for demo</span>

  <span style="color: #51afef;">protected</span> <span style="color: #ECBE7B;">Object</span>[] <span style="color: #dcaeea;">items</span> = ... whatever kinds of items being managed
  <span style="color: #51afef;">protected</span> <span style="color: #ECBE7B;">boolean</span>[] used = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">boolean</span>[MAX_AVAILABLE];

  <span style="color: #51afef;">protected</span> <span style="color: #51afef;">synchronized</span> <span style="color: #ECBE7B;">Object</span> <span style="color: #c678dd;">getNextAvailableItem</span>() {
    <span style="color: #51afef;">for</span> (<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> = <span style="color: #da8548; font-weight: bold;">0</span>; i &lt; <span style="color: #ECBE7B;">MAX_AVAILABLE</span>; ++i) {
      <span style="color: #51afef;">if</span> (<span style="color: #51afef; font-weight: bold;">!</span>used[i]) {
         used[i] = <span style="color: #a9a1e1;">true</span>;
         <span style="color: #51afef;">return</span> items[i];
      }
    }
    <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">null</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">not reached</span>
  }

  <span style="color: #51afef;">protected</span> <span style="color: #51afef;">synchronized</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">markAsUnused</span>(<span style="color: #ECBE7B;">Object</span> <span style="color: #dcaeea;">item</span>) {
    <span style="color: #51afef;">for</span> (<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> = <span style="color: #da8548; font-weight: bold;">0</span>; i &lt; <span style="color: #ECBE7B;">MAX_AVAILABLE</span>; ++i) {
      <span style="color: #51afef;">if</span> (item == items[i]) {
         <span style="color: #51afef;">if</span> (used[i]) {
           used[i] = <span style="color: #a9a1e1;">false</span>;
           <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">true</span>;
         } <span style="color: #51afef;">else</span>
           <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">false</span>;
      }
    }
    <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">false</span>;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6367f48" class="outline-2">
<h2 id="org6367f48">Semaphore 定义</h2>
<div class="outline-text-2" id="text-org6367f48">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">Semaphore.java</span>
<span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Semaphore</span> <span style="color: #51afef;">implements</span> <span style="color: #a9a1e1;">java</span>.<span style="color: #a9a1e1;">io</span>.<span style="color: #ECBE7B;">Serializable</span> {
    <span style="color: #51afef;">private</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">Sync</span> <span style="color: #dcaeea;">sync</span>;
    <span style="color: #51afef;">abstract</span> <span style="color: #51afef;">static</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Sync</span> <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">AbstractQueuedSynchronizer</span> { ... }
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#38750;&#20844;&#24179;&#23454;&#29616;</span><span style="color: #5B6268;"> */</span>
    <span style="color: #51afef;">static</span> <span style="color: #51afef;">final</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">NonfairSync</span> <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">Sync</span> {...}
    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#20844;&#24179;&#23454;&#29616;</span><span style="color: #5B6268;"> */</span>
    <span style="color: #51afef;">static</span> <span style="color: #51afef;">final</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">FairSync</span> <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">Sync</span> {...}

    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">Semaphore</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">permits</span>) {
        sync = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">NonfairSync</span>(permits);
    }
    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">Semaphore</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">permits</span>, <span style="color: #ECBE7B;">boolean</span> <span style="color: #dcaeea;">fair</span>) {
        sync = fair ? <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">FairSync</span>(permits) : <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">NonfairSync</span>(permits);
    }
</pre>
</div>
</div>
</div>
