notebook-org/java/Semaphore.org
** acquire()
#+BEGIN_SRC java
// Semaphore.java
public void acquire() throws InterruptedException {
    sync.acquireSharedInterruptibly(1);
}

// AbstractQueueSynchronizer.java
public final void acquireSharedInterruptibly(int arg)
        throws InterruptedException {
    if (Thread.interrupted()) /* 可中断的 */
        throw new InterruptedException();
    if (tryAcquireShared(arg) < 0)
        doAcquireSharedInterruptibly(arg);
}

#+END_SRC

tryAcquireShared(arg), 尝试减掉许可数量
#+BEGIN_SRC java
// AbstractQueueSynchronizer.java
protected int tryAcquireShared(int arg) {
    throw new UnsupportedOperationException();
}

// Semaphore.java NonfairSync
protected int tryAcquireShared(int acquires) {
    return nonfairTryAcquireShared(acquires);
}

// Semaphore.java Sync
final int nonfairTryAcquireShared(int acquires) {
    for (;;) { /* 自旋, 直到成功 */
        int available = getState();
        int remaining = available - acquires;
        if (remaining < 0 ||                          /* 可用数量 < 0, 交由后续判断 */
            compareAndSetState(available, remaining)) /* 可用数量 >= 0, 并且保存最新数量成功 */
            return remaining;
    }
}
#+END_SRC

doAcquireSharedInterruptibly(arg),
#+BEGIN_SRC java
// AbstractQueueSynchronizer.java
private void doAcquireSharedInterruptibly(int arg)
    throws InterruptedException {
    final Node node = addWaiter(Node.SHARED); /* 该方法保证将节点插入到队尾, 已在 ReentrantLock 里分析过了 */
    boolean failed = true;
    try {
        for (;;) {
            /* 阻塞, 直到成功返回 */
            final Node p = node.predecessor();
            if (p == head) { /* 只有前驱节点是head时, 才能继续 */
                int r = tryAcquireShared(arg); /* 获取可用数量, >=0表示拿到了许可 */
                if (r >= 0) {
                    setHeadAndPropagate(node, r); /* 修改头节点, 并且向后传递共享状态 */
                    p.next = null; // help GC
                    failed = false;
                    return;
                }
            }
            /* 同独占模式, 可以 park 时, 则 park */
            if (shouldParkAfterFailedAcquire(p, node) &&
                parkAndCheckInterrupt())
                throw new InterruptedException();
        }
    } finally {
        if (failed)
            cancelAcquire(node);
    }
}

private void setHeadAndPropagate(Node node, int propagate) {
    Node h = head; // Record old head for check below
    setHead(node); /* 设置头节点 */
    /*
     * Try to signal next queued node if:
     *   Propagation was indicated by caller,
     *     or was recorded (as h.waitStatus either before
     *     or after setHead) by a previous operation
     *     (note: this uses sign-check of waitStatus because
     *      PROPAGATE status may transition to SIGNAL.)
     * and
     *   The next node is waiting in shared mode,
     *     or we don't know, because it appears null
     *
     * The conservatism in both of these checks may cause
     * unnecessary wake-ups, but only when there are multiple
     * racing acquires/releases, so most need signals now or soon
     * anyway.
     */
    if (propagate > 0 || h == null || h.waitStatus < 0 ||
        (h = head) == null || h.waitStatus < 0) {
        Node s = node.next;
        if (s == null || s.isShared())
            doReleaseShared(); /* 我们在 release 小节分析 */
    }
}
#+END_SRC
