notebook/java/Semaphore.html

<div id="outline-container-orge7623a7" class="outline-2">
<h2 id="orge7623a7">NonfairSync</h2>
<div class="outline-text-2" id="text-orge7623a7">
</div>
<div id="outline-container-orgafbf643" class="outline-3">
<h3 id="orgafbf643">acquire()</h3>
<div class="outline-text-3" id="text-orgafbf643">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">Semaphore.java</span>
<span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">acquire</span>() <span style="color: #51afef;">throws</span> <span style="color: #ECBE7B;">InterruptedException</span> {
    sync.acquireSharedInterruptibly(<span style="color: #da8548; font-weight: bold;">1</span>);
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">AbstractQueueSynchronizer.java</span>
<span style="color: #51afef;">public</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">acquireSharedInterruptibly</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">arg</span>)
        <span style="color: #51afef;">throws</span> <span style="color: #ECBE7B;">InterruptedException</span> {
    <span style="color: #51afef;">if</span> (Thread.interrupted()) <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#21487;&#20013;&#26029;&#30340;</span><span style="color: #5B6268;"> */</span>
        <span style="color: #51afef;">throw</span> <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">InterruptedException</span>();
    <span style="color: #51afef;">if</span> (tryAcquireShared(arg) &lt; <span style="color: #da8548; font-weight: bold;">0</span>)
        doAcquireSharedInterruptibly(arg);
}

</pre>
</div>

<p>
tryAcquireShared(arg), 尝试减掉许可数量<br />
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">AbstractQueueSynchronizer.java</span>
<span style="color: #51afef;">protected</span> <span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">tryAcquireShared</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">arg</span>) {
    <span style="color: #51afef;">throw</span> <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">UnsupportedOperationException</span>();
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Semaphore.java NonfairSync</span>
<span style="color: #51afef;">protected</span> <span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">tryAcquireShared</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">acquires</span>) {
    <span style="color: #51afef;">return</span> nonfairTryAcquireShared(acquires);
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Semaphore.java Sync</span>
<span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">nonfairTryAcquireShared</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">acquires</span>) {
    <span style="color: #51afef;">for</span> (;;) { <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#33258;&#26059;, &#30452;&#21040;&#25104;&#21151;</span><span style="color: #5B6268;"> */</span>
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">available</span> = getState();
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">remaining</span> = available - acquires;
        <span style="color: #51afef;">if</span> (remaining &lt; <span style="color: #da8548; font-weight: bold;">0</span> ||                          <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#21487;&#29992;&#25968;&#37327; &lt; 0, &#20132;&#30001;&#21518;&#32493;&#21028;&#26029;</span><span style="color: #5B6268;"> */</span>
            compareAndSetState(available, remaining)) <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#21487;&#29992;&#25968;&#37327; &gt;= 0, &#24182;&#19988;&#20445;&#23384;&#26368;&#26032;&#25968;&#37327;&#25104;&#21151;</span><span style="color: #5B6268;"> */</span>
            <span style="color: #51afef;">return</span> remaining;
    }
}
</pre>
</div>

<p>
doAcquireSharedInterruptibly(arg),<br />
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">AbstractQueueSynchronizer.java</span>
<span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">doAcquireSharedInterruptibly</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">arg</span>)
    <span style="color: #51afef;">throws</span> <span style="color: #ECBE7B;">InterruptedException</span> {
    <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">node</span> = addWaiter(<span style="color: #a9a1e1;">Node</span>.SHARED); <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#35813;&#26041;&#27861;&#20445;&#35777;&#23558;&#33410;&#28857;&#25554;&#20837;&#21040;&#38431;&#23614;, &#24050;&#22312; ReentrantLock &#37324;&#20998;&#26512;&#36807;&#20102;</span><span style="color: #5B6268;"> */</span>
    <span style="color: #ECBE7B;">boolean</span> <span style="color: #dcaeea;">failed</span> = <span style="color: #a9a1e1;">true</span>;
    <span style="color: #51afef;">try</span> {
        <span style="color: #51afef;">for</span> (;;) {
            <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#38459;&#22622;, &#30452;&#21040;&#25104;&#21151;&#36820;&#22238;</span><span style="color: #5B6268;"> */</span>
            <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">p</span> = node.predecessor();
            <span style="color: #51afef;">if</span> (p == head) { <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#21482;&#26377;&#21069;&#39537;&#33410;&#28857;&#26159;head&#26102;, &#25165;&#33021;&#32487;&#32493;</span><span style="color: #5B6268;"> */</span>
                <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">r</span> = tryAcquireShared(arg); <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#33719;&#21462;&#21487;&#29992;&#25968;&#37327;, &gt;=0&#34920;&#31034;&#25343;&#21040;&#20102;&#35768;&#21487;</span><span style="color: #5B6268;"> */</span>
                <span style="color: #51afef;">if</span> (r &gt;= <span style="color: #da8548; font-weight: bold;">0</span>) {
                    setHeadAndPropagate(node, r); <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#20462;&#25913;&#22836;&#33410;&#28857;, &#24182;&#19988;&#21521;&#21518;&#20256;&#36882;&#20849;&#20139;&#29366;&#24577;</span><span style="color: #5B6268;"> */</span>
                    p.next = <span style="color: #a9a1e1;">null</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">help GC</span>
                    failed = <span style="color: #a9a1e1;">false</span>;
                    <span style="color: #51afef;">return</span>;
                }
            }
            <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#21516;&#29420;&#21344;&#27169;&#24335;, &#21487;&#20197; park &#26102;, &#21017; park</span><span style="color: #5B6268;"> */</span>
            <span style="color: #51afef;">if</span> (shouldParkAfterFailedAcquire(p, node) &amp;&amp;
                parkAndCheckInterrupt())
                <span style="color: #51afef;">throw</span> <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">InterruptedException</span>();
        }
    } <span style="color: #51afef;">finally</span> {
        <span style="color: #51afef;">if</span> (failed)
            cancelAcquire(node);
    }
}

<span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">setHeadAndPropagate</span>(<span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">node</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">propagate</span>) {
    <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">h</span> = head; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Record old head for check below</span>
    setHead(node); <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#35774;&#32622;&#22836;&#33410;&#28857;</span><span style="color: #5B6268;"> */</span>
    <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">     * Try to signal next queued node if:</span>
<span style="color: #5B6268;">     *   Propagation was indicated by caller,</span>
<span style="color: #5B6268;">     *     or was recorded (as h.waitStatus either before</span>
<span style="color: #5B6268;">     *     or after setHead) by a previous operation</span>
<span style="color: #5B6268;">     *     (note: this uses sign-check of waitStatus because</span>
<span style="color: #5B6268;">     *      PROPAGATE status may transition to SIGNAL.)</span>
<span style="color: #5B6268;">     * and</span>
<span style="color: #5B6268;">     *   The next node is waiting in shared mode,</span>
<span style="color: #5B6268;">     *     or we don't know, because it appears null</span>
<span style="color: #5B6268;">     *</span>
<span style="color: #5B6268;">     * The conservatism in both of these checks may cause</span>
<span style="color: #5B6268;">     * unnecessary wake-ups, but only when there are multiple</span>
<span style="color: #5B6268;">     * racing acquires/releases, so most need signals now or soon</span>
<span style="color: #5B6268;">     * anyway.</span>
<span style="color: #5B6268;">     */</span>
    <span style="color: #51afef;">if</span> (propagate &gt; <span style="color: #da8548; font-weight: bold;">0</span> || h == <span style="color: #a9a1e1;">null</span> || h.waitStatus &lt; <span style="color: #da8548; font-weight: bold;">0</span> ||
        (h = head) == <span style="color: #a9a1e1;">null</span> || h.waitStatus &lt; <span style="color: #da8548; font-weight: bold;">0</span>) {
        <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">s</span> = node.next;
        <span style="color: #51afef;">if</span> (s == <span style="color: #a9a1e1;">null</span> || s.isShared())
            doReleaseShared(); <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#25105;&#20204;&#22312; release &#23567;&#33410;&#20998;&#26512;</span><span style="color: #5B6268;"> */</span>
    }
}
</pre>
</div>
</div>
</div>
