notebook-org/java/Semaphore.org
** release()
#+BEGIN_SRC java
// Semaphore.java
public void release() {
    sync.releaseShared(1);
}

// AbstractQueuedSynchronizer.java
public final boolean releaseShared(int arg) {
    if (tryReleaseShared(arg)) {
        doReleaseShared();
        return true;
    }
    return false;
}

protected boolean tryReleaseShared(int arg) {
    throw new UnsupportedOperationException();
}

// Semaphore.java Sync
protected final boolean tryReleaseShared(int releases) {
    for (;;) { /* 不断尝试, 直到设置成功, 或越界 */
        int current = getState();
        int next = current + releases;
        if (next < current) // overflow
            throw new Error("Maximum permit count exceeded");
        if (compareAndSetState(current, next))
            return true;
    }
}

// AbstractQueuedSynchronizer.java
private void doReleaseShared() {
    /*
     * Ensure that a release propagates, even if there are other
     * in-progress acquires/releases.  This proceeds in the usual
     * way of trying to unparkSuccessor of head if it needs
     * signal. But if it does not, status is set to PROPAGATE to
     * ensure that upon release, propagation continues.
     * Additionally, we must loop in case a new node is added
     * while we are doing this. Also, unlike other uses of
     * unparkSuccessor, we need to know if CAS to reset status
     * fails, if so rechecking.
     */
    for (;;) {
        Node h = head;
        if (h != null && h != tail) {
            int ws = h.waitStatus;
            if (ws == Node.SIGNAL) { /* 头节点的 waitStatus 是 SIGNAL 时, CAS算法保证设置成0时, 才能唤醒后续节点 */
                if (!compareAndSetWaitStatus(h, Node.SIGNAL, 0))
                    continue;            // loop to recheck cases
                unparkSuccessor(h);
            }
            else if (ws == 0 &&      /* 头节点的 waitStatus 是 0 时, CAS算法设置成 PROPAGATE, 表示共享状态向后传播 */
                     !compareAndSetWaitStatus(h, 0, Node.PROPAGATE))
                continue;                // loop on failed CAS
        }
        if (h == head)                   // loop if head changed
            break;
    }
}

#+END_SRC

* FairSync
详细代码在 NonfairSync 小节内已经贴过了, 本小节只贴变动的代码

** acquire()
#+BEGIN_SRC java
protected int tryAcquireShared(int acquires) {
    for (;;) {
        if (hasQueuedPredecessors()) /* 如有有节点在排队, 则返回负数. 后续直接入队, 防止插队. */
            return -1;
        int available = getState();
        int remaining = available - acquires;
        if (remaining < 0 ||
            compareAndSetState(available, remaining))
            return remaining;
    }
}

#+END_SRC

** release()
跟 Nonfair 的版本一样.

* 小结
同样, Semaphore 也分公平模式和非公平模式, 实现这两种模式的代码也很简单.
至此, Semaphore 的主要代码都已看完, 通过这个类, 我们也简单的了解了一下 AQS 类的共享模式.
