notebook/java/Semaphore.html
<div id="outline-container-org6d19018" class="outline-3">
<h3 id="org6d19018">release()</h3>
<div class="outline-text-3" id="text-org6d19018">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">Semaphore.java</span>
<span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">release</span>() {
    sync.releaseShared(<span style="color: #da8548; font-weight: bold;">1</span>);
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">AbstractQueuedSynchronizer.java</span>
<span style="color: #51afef;">public</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">releaseShared</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">arg</span>) {
    <span style="color: #51afef;">if</span> (tryReleaseShared(arg)) {
        doReleaseShared();
        <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">true</span>;
    }
    <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">false</span>;
}

<span style="color: #51afef;">protected</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">tryReleaseShared</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">arg</span>) {
    <span style="color: #51afef;">throw</span> <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">UnsupportedOperationException</span>();
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Semaphore.java Sync</span>
<span style="color: #51afef;">protected</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">boolean</span> <span style="color: #c678dd;">tryReleaseShared</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">releases</span>) {
    <span style="color: #51afef;">for</span> (;;) { <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#19981;&#26029;&#23581;&#35797;, &#30452;&#21040;&#35774;&#32622;&#25104;&#21151;, &#25110;&#36234;&#30028;</span><span style="color: #5B6268;"> */</span>
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">current</span> = getState();
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">next</span> = current + releases;
        <span style="color: #51afef;">if</span> (next &lt; <span style="color: #ECBE7B;">current</span>) <span style="color: #5B6268;">// </span><span style="color: #5B6268;">overflow</span>
            <span style="color: #51afef;">throw</span> <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Error</span>(<span style="color: #98be65;">"Maximum permit count exceeded"</span>);
        <span style="color: #51afef;">if</span> (compareAndSetState(current, next))
            <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">true</span>;
    }
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">AbstractQueuedSynchronizer.java</span>
<span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">doReleaseShared</span>() {
    <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">     * Ensure that a release propagates, even if there are other</span>
<span style="color: #5B6268;">     * in-progress acquires/releases.  This proceeds in the usual</span>
<span style="color: #5B6268;">     * way of trying to unparkSuccessor of head if it needs</span>
<span style="color: #5B6268;">     * signal. But if it does not, status is set to PROPAGATE to</span>
<span style="color: #5B6268;">     * ensure that upon release, propagation continues.</span>
<span style="color: #5B6268;">     * Additionally, we must loop in case a new node is added</span>
<span style="color: #5B6268;">     * while we are doing this. Also, unlike other uses of</span>
<span style="color: #5B6268;">     * unparkSuccessor, we need to know if CAS to reset status</span>
<span style="color: #5B6268;">     * fails, if so rechecking.</span>
<span style="color: #5B6268;">     */</span>
    <span style="color: #51afef;">for</span> (;;) {
        <span style="color: #ECBE7B;">Node</span> <span style="color: #dcaeea;">h</span> = head;
        <span style="color: #51afef;">if</span> (h != <span style="color: #a9a1e1;">null</span> &amp;&amp; h != tail) {
            <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">ws</span> = h.waitStatus;
            <span style="color: #51afef;">if</span> (ws == <span style="color: #a9a1e1;">Node</span>.SIGNAL) { <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#22836;&#33410;&#28857;&#30340; waitStatus &#26159; SIGNAL &#26102;, CAS&#31639;&#27861;&#20445;&#35777;&#35774;&#32622;&#25104;0&#26102;, &#25165;&#33021;&#21796;&#37266;&#21518;&#32493;&#33410;&#28857;</span><span style="color: #5B6268;"> */</span>
                <span style="color: #51afef;">if</span> (<span style="color: #51afef; font-weight: bold;">!</span>compareAndSetWaitStatus(h, <span style="color: #a9a1e1;">Node</span>.SIGNAL, <span style="color: #da8548; font-weight: bold;">0</span>))
                    <span style="color: #51afef;">continue</span>;            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">loop to recheck cases</span>
                unparkSuccessor(h);
            }
            <span style="color: #51afef;">else</span> <span style="color: #51afef;">if</span> (ws == <span style="color: #da8548; font-weight: bold;">0</span> &amp;&amp;      <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#22836;&#33410;&#28857;&#30340; waitStatus &#26159; 0 &#26102;, CAS&#31639;&#27861;&#35774;&#32622;&#25104; PROPAGATE, &#34920;&#31034;&#20849;&#20139;&#29366;&#24577;&#21521;&#21518;&#20256;&#25773;</span><span style="color: #5B6268;"> */</span>
                     <span style="color: #51afef; font-weight: bold;">!</span>compareAndSetWaitStatus(h, <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #a9a1e1;">Node</span>.PROPAGATE))
                <span style="color: #51afef;">continue</span>;                <span style="color: #5B6268;">// </span><span style="color: #5B6268;">loop on failed CAS</span>
        }
        <span style="color: #51afef;">if</span> (h == head)                   <span style="color: #5B6268;">// </span><span style="color: #5B6268;">loop if head changed</span>
            <span style="color: #51afef;">break</span>;
    }
}

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge9f1f33" class="outline-2">
<h2 id="orge9f1f33">FairSync</h2>
<div class="outline-text-2" id="text-orge9f1f33">
<p>
详细代码在 NonfairSync 小节内已经贴过了, 本小节只贴变动的代码<br />
</p>
</div>

<div id="outline-container-orgc2df4e9" class="outline-3">
<h3 id="orgc2df4e9">acquire()</h3>
<div class="outline-text-3" id="text-orgc2df4e9">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">protected</span> <span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">tryAcquireShared</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">acquires</span>) {
    <span style="color: #51afef;">for</span> (;;) {
        <span style="color: #51afef;">if</span> (hasQueuedPredecessors()) <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">&#22914;&#26377;&#26377;&#33410;&#28857;&#22312;&#25490;&#38431;, &#21017;&#36820;&#22238;&#36127;&#25968;. &#21518;&#32493;&#30452;&#25509;&#20837;&#38431;, &#38450;&#27490;&#25554;&#38431;.</span><span style="color: #5B6268;"> */</span>
            <span style="color: #51afef;">return</span> -<span style="color: #da8548; font-weight: bold;">1</span>;
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">available</span> = getState();
        <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">remaining</span> = available - acquires;
        <span style="color: #51afef;">if</span> (remaining &lt; <span style="color: #da8548; font-weight: bold;">0</span> ||
            compareAndSetState(available, remaining))
            <span style="color: #51afef;">return</span> remaining;
    }
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org7e27469" class="outline-3">
<h3 id="org7e27469">release()</h3>
<div class="outline-text-3" id="text-org7e27469">
<p>
跟 Nonfair 的版本一样.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgaf01ea5" class="outline-2">
<h2 id="orgaf01ea5">小结</h2>
<div class="outline-text-2" id="text-orgaf01ea5">
<p>
同样, Semaphore 也分公平模式和非公平模式, 实现这两种模式的代码也很简单.<br />
至此, Semaphore 的主要代码都已看完, 通过这个类, 我们也简单的了解了一下 AQS 类的共享模式.<br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Saul Lawliet</p>
<p class="date">Created: 2022-01-13 Thu 22:47</p>
</div>
</body>
</html>
